hieunguyen3092003/STM32LAB1/STM32Lab1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RedLed_Pin GPIO_PIN_5
#define RedLed_GPIO_Port GPIOA
#define YellowLed_Pin GPIO_PIN_6
#define YellowLed_GPIO_Port GPIOA
#define GreenLed_Pin GPIO_PIN_7
#define GreenLed_GPIO_Port GPIOA
#define ALed_Pin GPIO_PIN_0
#define ALed_GPIO_Port GPIOB
#define BLed_Pin GPIO_PIN_1
#define BLed_GPIO_Port GPIOB
#define CLed_Pin GPIO_PIN_2
#define CLed_GPIO_Port GPIOB
#define RedLed2_Pin GPIO_PIN_8
#define RedLed2_GPIO_Port GPIOA
#define YellowLed2_Pin GPIO_PIN_9
#define YellowLed2_GPIO_Port GPIOA
#define GreenLed2_Pin GPIO_PIN_10
#define GreenLed2_GPIO_Port GPIOA
#define GLed_Pin GPIO_PIN_3
#define GLed_GPIO_Port GPIOB
#define FLed_Pin GPIO_PIN_4
#define FLed_GPIO_Port GPIOB
#define ELed_Pin GPIO_PIN_5
#define ELed_GPIO_Port GPIOB
#define DLed_Pin GPIO_PIN_6
#define DLed_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
